Revit 2027 API
BuiltInFailures.WallFailures.WallTypeIncompatibleWithTapered Property
 This wall's type is not compatible with the Tapered cross-section. Tapered walls require a variable thickness layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallTypeIncompatibleWithTapered { get; }
Public Shared ReadOnly Property WallTypeIncompatibleWithTapered As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallTypeIncompatibleWithTapered {
	FailureDefinitionId^ get ();
}
static member WallTypeIncompatibleWithTapered : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace